nxp-mcuxpresso/mcuxsdk-examples/_boards/evkbmimxrt1060/component_examples/flash_component/semc_nand/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_EMC_24 (coord D3), SEMC_CAS */
#define BOARD_SEMC_CAS_PERIPHERAL                                           SEMC   /*!< Device name: SEMC */
#define BOARD_SEMC_CAS_SIGNAL                                           semc_cas   /*!< SEMC signal: semc_cas */

/* GPIO_EMC_27 (coord A2), SEMC_CKE */
#define BOARD_SEMC_CKE_PERIPHERAL                                           SEMC   /*!< Device name: SEMC */
#define BOARD_SEMC_CKE_SIGNAL                                           semc_cke   /*!< SEMC signal: semc_cke */

/* GPIO_EMC_26 (coord B3), SEMC_CLK */
#define BOARD_SEMC_CLK_PERIPHERAL                                           SEMC   /*!< Device name: SEMC */
#define BOARD_SEMC_CLK_SIGNAL                                           semc_clk   /*!< SEMC signal: semc_clk */

/* GPIO_EMC_28 (coord D1), SEMC_WE */
#define BOARD_SEMC_WE_PERIPHERAL                                            SEMC   /*!< Device name: SEMC */
#define BOARD_SEMC_WE_SIGNAL                                             semc_we   /*!< SEMC signal: semc_we */

/* GPIO_EMC_25 (coord D2), SEMC_RAS */
#define BOARD_SEMC_RAS_PERIPHERAL                                           SEMC   /*!< Device name: SEMC */
#define BOARD_SEMC_RAS_SIGNAL                                           semc_ras   /*!< SEMC signal: semc_ras */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define BOARD_UART1_RXD_PERIPHERAL                                       LPUART1   /*!< Device name: LPUART1 */
#define BOARD_UART1_RXD_SIGNAL                                                RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define BOARD_UART1_TXD_PERIPHERAL                                       LPUART1   /*!< Device name: LPUART1 */
#define BOARD_UART1_TXD_SIGNAL                                                TX   /*!< LPUART1 signal: TX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
